spec/spec/SVWS/IntegrationPlatform/Examples/InternalAccountBankTransferRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://sv.bpc.in/SVIP">
    <soapenv:Header/>
    <soapenv:Body>
    <int:IFX>
        <XferAddRq>
            <RqUID>3127a63b-d8f1-4bed-94ad-d96ffd321a86</RqUID>
            <MsgRqHdr>
                <ContextRqHdr>
                    <NetworkTrnData>
                        <NetworkOwner>Branch</NetworkOwner>
                        <TerminalIdent>10000073</TerminalIdent>
                    </NetworkTrnData>
                    <ClientDt>2011-08-08T12:45:45</ClientDt>
                </ContextRqHdr>
            </MsgRqHdr>
            <XferInfo>
                <FromAcctRef>
                    <AcctKeys>
                        <AcctIdent>
                            <AcctIdentType>AcctNum</AcctIdentType>
                            <AcctIdentValue>40817810020002354678</AcctIdentValue>
                        </AcctIdent>
                    </AcctKeys>
                </FromAcctRef>
                <ToAcctRef>
                    <AcctKeys>
                        <AcctIdent>
                            <AcctIdentType>AcctNum</AcctIdentType>
                            <AcctIdentValue>40817810020000127849</AcctIdentValue>
                        </AcctIdent>
                    </AcctKeys>
                </ToAcctRef>
                <CurAmt>
                    <Amt>70000</Amt>
                    <CurCode>
                        <CurCodeValue>RUB</CurCodeValue>
                    </CurCode>
                </CurAmt>
            </XferInfo>
        </XferAddRq>
    </int:IFX>
    </soapenv:Body>
</soapenv:Envelope>